In [34]:
import pandas as pd
import numpy as np
import csv

In [35]:
pwd

'C:\\Users\\shadr\\OneDrive\\Desktop\\Starter_Code\\PyBank\\Resources'

In [36]:
cd Resources

[WinError 2] The system cannot find the file specified: 'Resources'
C:\Users\shadr\OneDrive\Desktop\Starter_Code\PyBank\Resources

In [37]:
sales_data = pd.read_csv('budget_data.csv')

In [38]:
sales_data

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [39]:
sales_data.head() #  to give guidance on the first date =date_1

       Date  Profit/Losses
0  Jan-2010         867884
1  Feb-2010         984655
2  Mar-2010         322013
3  Apr-2010         -69417
4  May-2010         310503

In [40]:
sales_data.tail() # to give guidance on the last date =date_2

        Date  Profit/Losses
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

In [41]:
* The total number of months included in the dataset.

* The net total amount of Profit/Losses over the entire period.

* The average of the changes in Profit/Losses over the entire period.

* The greatest increase in profits (date and amount) over the entire period.

* The greatest decrease in losses (date and amount) over the entire period.

Your resulting analysis should look similar to the following:

  ```text
  Financial Analysis
  ----------------------------
  Total Months: 86
  Total: $38382578
  Average  Change: $-2315.12
  Greatest Increase in Profits: Feb-2012 ($1926159)
  Greatest Decrease in Profits: Sep-2013 ($-2196167)
  ```

SyntaxError: invalid syntax (3334918850.py, line 1)

# The total number of months included in the dataset

In [42]:
import datetime

In [43]:
end_date = datetime.datetime(2017,2,28)

start_date = datetime.datetime(2010,1,1)

num_months = (end_date.year - start_date.year) * 12 + (end_date.month - start_date.month)

print(num_months) # the number of months

85

In [59]:
#  The net total amount of Profit/Losses over the entire period.
cumulative_profit_loss = sales_data['Profit/Losses'].cumsum()
    
print(cumulative_profit_loss)

0       867884
1      1852539
2      2174552
3      2105135
4      2415638
        ...
81    36716347
82    37512261
83    37573249
84    37711479
85    38382578
Name: Profit/Losses, Length: 86, dtype: int64

In [60]:
#The average of the changes in Profit/Losses over the entire period.

sales_data.sum()

Date             Jan-2010Feb-2010Mar-2010Apr-2010May-2010Jun-20...
Profit/Losses                                             38382578
dtype: object

In [57]:
sales_data.max()

Date             Sep-2016
Profit/Losses     1170593
dtype: object

In [58]:
sales_data.min()

Date             Apr-2010
Profit/Losses    -1196225
dtype: object